HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPort_reg.h
/** \\brief  94, Port Output Modification Clear Register */
#define P00_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003A094u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P00_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003A080u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P00_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003A08Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P00_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003A084u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P00_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003A088u)

/** \\brief  4, Port Output Modification Register */
#define P00_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003A004u)

/** \\brief  90, Port Output Modification Set Register */
#define P00_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003A090u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P00_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003A070u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P00_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003A07Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P00_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003A074u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P00_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003A078u)

/** \\brief  0, Port Output Register */
#define P00_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003A000u)

/** \\brief  64, Port Pin Controller Select Register */
#define P00_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003A064u)


/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P00_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003A040u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P00_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003A044u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P01
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P01_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003A1FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P01_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003A1F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P01_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003A150u)

/** \\brief  8, Identification Register */
#define P01_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003A108u)

/** \\brief  24, Port Input Register */
#define P01_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003A124u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P01_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003A110u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P01_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003A11Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P01_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003A114u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P01_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003A118u)





/** \\brief  94, Port Output Modification Clear Register */
#define P01_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003A194u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P01_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003A180u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P01_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003A18Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P01_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003A184u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P01_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003A188u)

/** \\brief  4, Port Output Modification Register */
#define P01_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003A104u)

/** \\brief  90, Port Output Modification Set Register */
#define P01_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003A190u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P01_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003A170u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P01_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003A17Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P01_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003A174u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P01_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003A178u)

/** \\brief  0, Port Output Register */
#define P01_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003A100u)



/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P01_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003A140u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P01_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003A144u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P02
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P02_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003A2FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P02_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003A2F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P02_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003A250u)

/** \\brief  8, Identification Register */
#define P02_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003A208u)

/** \\brief  24, Port Input Register */
#define P02_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003A224u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P02_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003A210u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P02_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003A21Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P02_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003A214u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P02_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003A218u)





