HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPort_reg.h
/** \\brief  94, Port Output Modification Clear Register */
#define P11_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003B194u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P11_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003B180u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P11_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003B18Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P11_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003B184u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P11_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003B188u)

/** \\brief  4, Port Output Modification Register */
#define P11_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003B104u)

/** \\brief  90, Port Output Modification Set Register */
#define P11_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003B190u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P11_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003B170u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P11_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003B17Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P11_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003B174u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P11_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003B178u)

/** \\brief  0, Port Output Register */
#define P11_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003B100u)

/** \\brief  64, Port Pin Controller Select Register */
#define P11_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003B164u)


/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P11_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003B140u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P11_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003B144u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P12
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P12_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003B2FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P12_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003B2F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P12_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003B250u)

/** \\brief  8, Identification Register */
#define P12_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003B208u)

/** \\brief  24, Port Input Register */
#define P12_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003B224u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P12_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003B210u)








/** \\brief  94, Port Output Modification Clear Register */
#define P12_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003B294u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P12_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003B280u)




/** \\brief  4, Port Output Modification Register */
#define P12_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003B204u)

/** \\brief  90, Port Output Modification Set Register */
#define P12_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003B290u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P12_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003B270u)




/** \\brief  0, Port Output Register */
#define P12_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003B200u)



/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P12_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003B240u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P13
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P13_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003B3FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P13_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003B3F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P13_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003B350u)

/** \\brief  8, Identification Register */
#define P13_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003B308u)

/** \\brief  24, Port Input Register */
#define P13_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003B324u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P13_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003B310u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P13_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003B31Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P13_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003B314u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P13_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003B318u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P13_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003B3A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P13_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003B3A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P13_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003B3A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P13_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003B3ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P13_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003B394u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P13_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003B380u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P13_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003B38Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P13_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003B384u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P13_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003B388u)

/** \\brief  4, Port Output Modification Register */
#define P13_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003B304u)

/** \\brief  90, Port Output Modification Set Register */
#define P13_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003B390u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P13_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003B370u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P13_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003B37Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P13_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003B374u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P13_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003B378u)

