HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPort_reg.h
/** \\brief  94, Port Output Modification Clear Register */
#define P24_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C494u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P24_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C480u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P24_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003C48Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P24_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003C484u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P24_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003C488u)

/** \\brief  4, Port Output Modification Register */
#define P24_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C404u)

/** \\brief  90, Port Output Modification Set Register */
#define P24_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C490u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P24_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C470u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P24_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003C47Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P24_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003C474u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P24_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003C478u)

/** \\brief  0, Port Output Register */
#define P24_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C400u)



/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P24_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C440u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P24_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003C444u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P25
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P25_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C5FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P25_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C5F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P25_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C550u)

/** \\brief  8, Identification Register */
#define P25_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C508u)

/** \\brief  24, Port Input Register */
#define P25_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C524u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P25_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C510u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P25_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003C51Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P25_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003C514u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P25_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003C518u)





/** \\brief  94, Port Output Modification Clear Register */
#define P25_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C594u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P25_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C580u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P25_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003C58Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P25_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003C584u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P25_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003C588u)

/** \\brief  4, Port Output Modification Register */
#define P25_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C504u)

/** \\brief  90, Port Output Modification Set Register */
#define P25_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C590u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P25_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C570u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P25_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003C57Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P25_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003C574u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P25_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003C578u)

/** \\brief  0, Port Output Register */
#define P25_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C500u)



/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P25_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C540u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P25_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003C544u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P26
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P26_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C6FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P26_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C6F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P26_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C650u)

/** \\brief  8, Identification Register */
#define P26_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C608u)

/** \\brief  24, Port Input Register */
#define P26_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C624u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P26_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C610u)








/** \\brief  94, Port Output Modification Clear Register */
#define P26_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C694u)

