HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPort_reg.h
/** \\brief  80, Port Output Modification Clear Register 0 */
#define P26_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C680u)




/** \\brief  4, Port Output Modification Register */
#define P26_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C604u)

/** \\brief  90, Port Output Modification Set Register */
#define P26_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C690u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P26_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C670u)




/** \\brief  0, Port Output Register */
#define P26_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C600u)



/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P26_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C640u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P30
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P30_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003D0FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P30_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D0F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P30_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D050u)

/** \\brief  8, Identification Register */
#define P30_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D008u)

/** \\brief  24, Port Input Register */
#define P30_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D024u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P30_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D010u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P30_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003D01Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P30_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003D014u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P30_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003D018u)





/** \\brief  94, Port Output Modification Clear Register */
#define P30_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D094u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P30_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D080u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P30_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003D08Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P30_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003D084u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P30_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003D088u)

/** \\brief  4, Port Output Modification Register */
#define P30_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D004u)

/** \\brief  90, Port Output Modification Set Register */
#define P30_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D090u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P30_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D070u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P30_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003D07Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P30_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003D074u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P30_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003D078u)

/** \\brief  0, Port Output Register */
#define P30_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003D000u)



/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P30_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D040u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P30_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003D044u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P31
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P31_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003D1FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P31_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D1F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P31_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D150u)

/** \\brief  8, Identification Register */
#define P31_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D108u)

/** \\brief  24, Port Input Register */
#define P31_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D124u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P31_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D110u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P31_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003D11Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P31_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003D114u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P31_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003D118u)





/** \\brief  94, Port Output Modification Clear Register */
#define P31_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D194u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P31_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D180u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P31_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003D18Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P31_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003D184u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P31_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003D188u)

/** \\brief  4, Port Output Modification Register */
#define P31_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D104u)

/** \\brief  90, Port Output Modification Set Register */
#define P31_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D190u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P31_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D170u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P31_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003D17Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P31_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003D174u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P31_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003D178u)

